---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Plumbing.PipingSystemType
source: html/a54415a7-dba5-b537-0461-8a6b82679016.htm
---
# PipingSystemType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.